server/app/controllers/api/v1/voice_captures_controller.rb

      def create
        provider = params[:provider] || 'siri'
        text = params[:text] || params[:utterance] || params[:task_text]
        organization_id = params[:organization_id] || Organization.first&.id

        if text.blank?
          log_command(provider, text, 'create_task', 0.0, 'failed')
          render json: { error: 'Task text is required' }, status: :unprocessable_entity
          return
        end

        organization = Organization.find_by(id: organization_id) || Organization.first
        task = Task.create!(
          title: text,
          source: provider,
          status: 'pending',
          organization: organization
        )
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 980190966], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "description", "status", "due_at", "completed_at", "raw_transcript", "source", "discarded_at", "created_at", "updated_at", "organization_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"